# Мультизагрузка и выбор операционной системы

Для реализации этой задачи мы будем использовать различные команды и параметры. 

## Команды и параметры

### `loopback loop $isofile`

Эта команда указывает GRUB создать loopback устройство из ISO-файла. Это позволяет ядру обращаться к файлам в ISO, как если бы они находились на обычном файловом устройстве.

### `vmlinuz` и `initrd`

Это указания на бинарные файлы ядра и начальный RAM-диск (Initial RAM Disk). Они загружают ядро и начальную файловую систему в память при загрузке.

### `archisolabel=ARCH_201505`

Это параметр ядра, указывающий метку файловой системы образа ISO.

### `img_dev=$imgdevpath` и `img_loop=$isofile`

Эти параметры ядра определяют устройство и путь к образу ISO.

### `boot=casper`

Этот параметр указывает, что система должна загружаться с использованием Casper, скрипта Ubuntu для загрузки Live CD.

### `iso-scan/filename=$isofile`

Этот параметр указывает расположение образа ISO.

### `locale=en_US.UTF-8`

Этот параметр устанавливает локализацию системы.

### `ro, quiet, splash, noeject, noprompt`

Это параметры, контролирующие различные аспекты процесса загрузки и работы системы. Они делают процесс загрузки тише (меньше сообщений), красивее (с использованием сплэш-экрана), предотвращают извлечение CD после загрузки и отключают запросы у пользователя во время загрузки.

### `toram`

Этот параметр копирует содержимое live CD в оперативную память, что позволяет извлечь диск после загрузки.

### `fromiso`

Этот параметр указывает путь к ISO-образу на диске.
